app/Models/CrudModel.php

INSERT INTO `tb_alumnos` (`nombreTb_Alumnos`, `emailTb_Alumnos`, `direccionTb_Alumnos`, `telefonoTb_Alumnos`, `usuarioTb_Alumnos`) VALUES ('Diana', 'dannapb35@gmail.com', 'jutiapa', '09308553', '04')
---
    public function insertar($datos)
    {
        $Nombres = $this->db->table('tb_alumnos');
        $Nombres->insert($datos);